"""
Створіть масив зі строками, які будуть складатися з чисел, які розділені комою. Наприклад:
[”1,2,3,4”, ”1,2,3,4,50” ”qwerty1,2,3”]
Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).
Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести “Не можу це зробити!”
Використовуйте блок try except, щоб уникнути інших символів, окрім чисел у списку.
Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”

"""

hw_array = [
    "1,2,3",
    "10,20,30,40",
    "qwerty7,14,21",
    "test100,200,300,400,500"
]

"""
Функція містить цикл, що рахує суму чистих чисел масиву та виводить рядок, якщо числа містять текст.
1. Цикл перебирає кожен елемент масиву
2. Блок try:
-- розбиває рядок на частини рядка по комі
-- перетворює частини рядка на число
(якщо поверне помилку, коли рядок містить літери, то перейде в блок Except)
-- формує список чисел
- рахує суму чисел
- виводить результат

3. Блок except:
- виводить "Не можу це зробити!" у разі, якщо блок try не спрацював (список містить текст) 

"""

def numbers_sum(lst):
    for number in lst:
        try:
            list_parts = number.split(',')
            numbers = map(int, list_parts)
            numbers_list = list(numbers)
            total = sum(numbers_list)
            print(total)
        except Exception as e:
            print("Не можу це зробити!")

numbers_sum(hw_array)


