# Порахувати кількість унікальних символів в строці.
# Якщо їх більше 10 - вивести в консоль True, інакше - False.
# Строку отримати за допомогою функції input()

# Отримую рядок з вводу

output_string = input("Enter any text below:\n")

# Створюю змінну для циклу (лічильник символів, що зустрілись 1 раз)

unic_chars = 0

# Проходжусь циклом по рядку, щоб визначити кількість унікальних символів

for char in output_string:
      if output_string.count(char) == 1:
          unic_chars += 1

# Визначаю, чи унікальних символів більше 10 і виводжу результат

if unic_chars > 10:
    print(True)
else:
    print(False)

